jpnorair/OpenTag/platform/stm32l0xx/otsys_veelite_SRAM.c
/*  Copyright 2008-2022, JP Norair
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright 
  *    notice, this list of conditions and the following disclaimer in the 
  *    documentation and/or other materials provided with the distribution.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE 
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE 
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
  * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
  * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS 
  * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
  * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
  * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE 
  * POSSIBILITY OF SUCH DAMAGE.
  */
/**
  * @file       /platform/stm32l0xx/otsys_veelite_SRAM.c
  * @author     JP Norair
  * @version    R100
  * @date       30 Dec 2016
  * @brief      SRAM Method for Veelite Core Functions
  * @ingroup    Veelite
  *
  * @note This implementation also works as-is with most other STM32 devices, 
  *       although FLASH_...() library functions used within will need to be 
  *       linked to the respective platform library (L0, L1, F0, F1, etc).
  * 
  * Summary:
  * This module is part of the Veelite Core, which contains the low-level read
  * and write filesystem functionality.  This variant is meant for systems that
  * use NAND FLASH as the source of non-volatile memory, and which have enough
  * SRAM to load the entire filesystem into a part of it.  At power down or
  * reset conditions, the contents of the Filesystem SRAM will be written back
  * to Flash.
  *
  ******************************************************************************
  */

#include <otplatform.h>
#if defined(__STM32L0xx__) && (defined(__NOEEPROM__) || defined(__VLSRAM__))

#include "stm32l0xx_hal.h"

#include <otsys/veelite_core.h>
#include <otlib/logger.h>
#include <otlib/memcpy.h>



static ot_u32 fsram[FLASH_FS_ALLOC/4];
#define FSRAM ((ot_u16*)fsram)


/** MACROS for STM32F0xx library <BR>
  * ========================================================================<BR>
  * @note If you are upgrading the STM32 FW lib, you need to modify the file 
  * stm32f0xx_flash.h file in a simple way.  The FLASH_Status enum type needs to
  * have FLASH_COMPLETE = 0 instead of 4.
  */

/// NAND wrappers
ot_u8 NAND_erase_page(ot_u16* page_addr) {
    HAL_FLASH_Unlock();
    FLASH_ErasePage((uint32_t)page_addr);
    HAL_FLASH_Lock();
    return 0;
}






/// VLX2 Debugging
/// This driver is quite stable, so debugging features are not implemented
/// even when __DEBUG__ is active
#ifdef __DEBUG__
//#   define _VLSRAM_DEBUG
#endif

/// Set Segmentation Fault (code 11) if trying to access an invalid virtual
/// address.  Vector to NMI
#if (defined _VLSRAM_DEBUG)
#   define SEGFAULT_CHECK(ADDR, BANK, MSGLEN, MSG) \
        do { \
            if (vas_check(ADDR) != BANK) { \
                platform.error_code = 11; \
                SCB->ICSR |= SCB_ICSR_NMIPENDSET_Msk; \
            } \
        } while (0)
#else
#   define SEGFAULT_CHECK(ADDR, BANK, MSGLEN, MSG); 
#endif



/// Set Bus Error (code 7) on physical flash access faults (X2table errors).
/// Vector to Access Violation ISR 
#if defined(_VLSRAM_DEBUG)
#   define BUSERROR_CHECK(EXPR, MSGLEN, MSG) \
        do { \
            if (EXPR) { \
                platform.error_code = 7; \
                SCB->ICSR |= SCB_ICSR_NMIPENDSET_Msk; \
            } \
        } while (0)
#else
#   define BUSERROR_CHECK(EXPR, MSGLEN, MSG);
#endif





/** Generic Veelite Core Function Implementations <BR>
  * ========================================================================<BR>
  * Used for any and all memory topologies
  */
vas_loc vas_check(vaddr addr) {
    ot_s32 scratch;
    
    scratch = addr - VWORM_BASE_VADDR;
    if ((scratch >= 0) && (scratch < VWORM_SIZE))   return in_vworm;
    
    scratch = addr - VSRAM_BASE_VADDR;
    if ((scratch >= 0) && (scratch < VSRAM_SIZE))   return in_vsram;

    return vas_error;
}





/** VWORM Functions <BR>
  * ========================================================================<BR>
  */

#ifndef EXTF_vworm_format
ot_u8 vworm_format( ) {
    return 0;
}
#endif


#ifndef EXTF_vworm_fsalloc
ot_u32 vworm_fsalloc(const vlFSHEADER* fs) {
    ot_u32 alloc;

    if (fs == NULL) {
        alloc   = 0;
    }
    else {
        alloc   = fs->ftab_alloc;
        alloc  += fs->gfb.alloc;
        alloc  += fs->iss.alloc;
        alloc  += fs->isf.alloc;
    }

    return alloc;
}
#endif


#ifndef EXTF_vworm_init
ot_u8 vworm_init() {
    ot_memcpy_4(fsram, (ot_u32*)FLASH_FS_ADDR, sizeof(fsram)/4);
    return 0;
}
#endif


#ifndef EXTF_vworm_print_table
void vworm_print_table() {
}
#endif



#ifndef EXTF_vworm_save
ot_u8 vworm_save( ) {
/// Save data from fsram into FLASH
    uint32_t*   ram1    = &fsram[0];
    uint32_t*   ram2    = &fsram[16];
    uint32_t*   limit   = &fsram[ sizeof(fsram)/4 ];
    uint32_t    flash1  = FLASH_FS_ADDR;
    uint32_t    flash2  = FLASH_FS_ADDR+64;
    
    HAL_FLASH_Unlock();
    
    while (ram2 < limit) {
        HAL_FLASHEx_ProgramParallelHalfPage(flash1, ram1, flash2, ram2);
        ram1    = (ot_u32*)(128 + (ot_u8*)ram1);
        ram2    = (ot_u32*)(128 + (ot_u8*)ram1);
        flash1 += 128;
        flash2 += 128;
    }
    
    HAL_FLASH_Lock();
    return 0;
}
#endif



#ifndef EXTF_vworm_read
ot_u16 vworm_read(vaddr addr) {
    ot_u16* data;
    addr   -= VWORM_BASE_VADDR;
    addr   &= ~1;
    data    = (ot_u16*)((ot_u8*)fsram + addr);
    return *data;
}
#endif



#ifndef EXTF_vworm_write
ot_u8 vworm_write(vaddr addr, ot_u16 data) {
    ot_u16* aptr;
    addr   -= VWORM_BASE_VADDR;
    addr   &= ~1;
    aptr    = (ot_u16*)((ot_u8*)fsram + addr);
    *aptr   = data;
    return 0;
}
#endif
    


#ifndef EXTF_vworm_mark
ot_u8 vworm_mark(vaddr addr, ot_u16 value) {
    return vworm_write(addr, value);
}
#endif



#ifndef EXTF_vworm_mark_physical
ot_u8 vworm_mark_physical(ot_u16* addr, ot_u16 value) {
#   if ((VWORM_SIZE > 0) && (OT_FEATURE_VLNVWRITE == ENABLED))
    BUSERROR_CHECK( (((ot_u32)addr < (ot_u32)fsram) || \
                    ((ot_u32)addr >= (ot_u32)(&fsram[FLASH_FS_ALLOC/4]))), 7, "VLC_"__LINE__);
                    
    *addr = value;
#   endif
    return 0;
}
#endif

#ifndef EXTF_vworm_get
ot_u8* vworm_get(vaddr addr) {
    addr -= VWORM_BASE_VADDR;
    return (ot_u8*)fsram + addr;
}
#endif

#ifndef EXTF_vworm_wipeblock
ot_u8 vworm_wipeblock(vaddr addr, ot_uint wipe_span) {
    return 0;
}
#endif





/** VSRAM Functions <BR>
  * ========================================================================<BR>
  * SRAM version of Veelite doesn't utilize VSRAM
  */

#ifndef EXTF_vsram_read
ot_u16 vsram_read(vaddr addr) {
    return vworm_read(addr);
}
#endif

#ifndef EXTF_vsram_mark
ot_u8 vsram_mark(vaddr addr, ot_u16 value) {
    return vworm_mark(addr, value);
}
#endif

#ifndef EXTF_vsram_mark_physical
ot_u8 vsram_mark_physical(ot_u16* addr, ot_u16 value) {
    return vworm_mark_physical(addr, value);
}
#endif

#ifndef EXTF_vsram_get
ot_u8* vsram_get(vaddr addr) {
    return vworm_get(addr);
}
#endif



#endif //from top
